xpress-embedo/PS2_Keyboard_CortexM3/Drivers/source/lpc13xx_i2c.c
/**
 * @file	: lpc13xx_i2c.c
 * @brief	: Contains all functions support for I2C firmware library on LPC13xx
 * @version	: 1.0
 * @date	: 9. April. 2009
 * @author	: HieuNguyen
 *----------------------------------------------------------------------------
 * Software that is described herein is for illustrative purposes only
 * which provides customers with programming information regarding the
 * products. This software is supplied "AS IS" without any warranties.
 * NXP Semiconductors assumes no responsibility or liability for the
 * use of the software, conveys no license or title under any patent,
 * copyright, or mask work right to the product. NXP Semiconductors
 * reserves the right to make changes in the software without
 * notification. NXP Semiconductors also make no representation or
 * warranty that such application will be suitable for the specified
 * use without further testing or modification.
 **********************************************************************/

#include "lpc13xx_i2c.h"
#include "lpc13xx_gpio.h"


/* If this source file built with example, the LPC13xx FW library configuration
 * file in each example directory ("lpc13xx_libcfg.h") must be included,
 * otherwise the default FW library configuration file must be included instead
 */

//#ifdef _I2C


/************************** PRIVATE VARIABLES *************************/

/** @addtogroup Private_Variables
 * @{
 */

/** @defgroup 	I2C_Private_Variables
 * @{
 */

/* I2C device configuration structure type */
typedef struct
{
  uint32_t      txrx_setup; 						/* Transmission setup */
  int32_t		dir;								/* Current direction phase, 0 - write, 1 - read */
  void		(*inthandler)(LPC_I2C_TypeDef *i2c);   	/* Transmission interrupt handler */
} I2C_CFG_T;

/* I2C driver data for I2C */
static I2C_CFG_T i2cdat;


/**
 * @}
 */

/**
 * @}
 */

/***************************** PRIVATE FUNCTION *****************************/
/** @addtogroup  Private_Functions
  * @{
  */

/** @defgroup 	I2C_Private_Functions
 * @{
 */


/* Generate a start condition on I2C bus (in master mode only) */
static uint32_t I2C_Start (LPC_I2C_TypeDef *i2c);

/* Generate a stop condition on I2C bus (in master mode only) */
static void I2C_Stop (LPC_I2C_TypeDef *i2c);

/* I2C send byte subroutine */
static uint32_t I2C_SendByte (LPC_I2C_TypeDef *i2c, uint8_t databyte);

/* I2C get byte subroutine */
static uint32_t I2C_GetByte (LPC_I2C_TypeDef *i2c, uint8_t *retdat, Bool ack);

/* I2C interrupt master handler */
void I2C_MasterHandler (LPC_I2C_TypeDef *i2c);

/* I2C interrupt master handler */
void I2C_SlaveHandler (LPC_I2C_TypeDef *i2c);

/* Enable interrupt for I2C device */
void I2C_IntCmd (LPC_I2C_TypeDef *i2c, Bool NewState);

/*--------------------------------------------------------------------------------*/


/***********************************************************************
 * Function: I2C_Start
 * Purpose: Generate a start condition on I2C bus (in master mode only)
 * Parameters:
 *     i2cdev: Pointer to I2C register
 *     blocking: blocking or none blocking mode
 * Returns: value of I2C status register after generate a start condition
 **********************************************************************/
static uint32_t I2C_Start (LPC_I2C_TypeDef *i2c)
{
	i2c->CONCLR = I2C_I2CONCLR_SIC;
	i2c->CONSET = I2C_I2CONSET_STA;

	// Wait for complete
	while (!(i2c->CONSET & I2C_I2CONSET_SI));
	i2c->CONCLR = I2C_I2CONCLR_STAC;
	return (i2c->STAT & I2C_STAT_CODE_BITMASK);
}


/***********************************************************************
 * Function: I2C_Stop
 * Purpose: Generate a stop condition on I2C bus (in master mode only)
 * Parameters:
 *     i2c: Pointer to I2C register
 * Returns: None
 **********************************************************************/
static void I2C_Stop (LPC_I2C_TypeDef *i2c)
{

	/* Make sure start bit is not active */
	if (i2c->CONSET & I2C_I2CONSET_STA)
	{
		i2c->CONCLR = I2C_I2CONCLR_STAC;
	}
	i2c->CONSET = I2C_I2CONSET_STO;
	i2c->CONCLR = I2C_I2CONCLR_SIC;
}


/***********************************************************************
 * Function: I2C_SendByte
 * Purpose: Send a byte
 * Parameters:
 *     i2c: Pointer to I2C register
 * Returns: value of I2C status register after sending
 **********************************************************************/
static uint32_t I2C_SendByte (LPC_I2C_TypeDef *i2c, uint8_t databyte)
{
	/* Make sure start bit is not active */
	if (i2c->CONSET & I2C_I2CONSET_STA)
	{
		i2c->CONCLR = I2C_I2CONCLR_STAC;
	}
	i2c->DAT = databyte & I2C_I2DAT_BITMASK;
	i2c->CONCLR = I2C_I2CONCLR_SIC;

	while (!(i2c->CONSET & I2C_I2CONSET_SI));
	return (i2c->STAT & I2C_STAT_CODE_BITMASK);
}


/***********************************************************************
 * Function: I2C_GetByte
 * Purpose: Get a byte
 * Parameters:
 *     i2c: Pointer to I2C register
 * Returns: value of I2C status register after receiving
 **********************************************************************/
static uint32_t I2C_GetByte (LPC_I2C_TypeDef *i2c, uint8_t *retdat, Bool ack)
{
	if (ack == TRUE)
	{
		i2c->CONSET = I2C_I2CONSET_AA;
	}
	else
	{
		i2c->CONCLR = I2C_I2CONCLR_AAC;
	}
	i2c->CONCLR = I2C_I2CONCLR_SIC;

	while (!(i2c->CONSET & I2C_I2CONSET_SI));
	*retdat = (uint8_t) (i2c->DAT & I2C_I2DAT_BITMASK);
	return (i2c->STAT & I2C_STAT_CODE_BITMASK);
}



/*********************************************************************//**
 * @brief 		Enable/Disable interrupt for I2C peripheral
 * @param[in]	i2c	I2C peripheral selected, should be I2C0, I2C1 or I2C2
 * @param[in]	NewState	New State of I2C peripheral interrupt in NVIC core
 * 							should be:
 * 							- ENABLE: enable interrupt for this I2C peripheral
 * 							- DISABLE: disable interrupt for this I2C peripheral
 * @return 		None
 **********************************************************************/
void I2C_IntCmd (LPC_I2C_TypeDef *i2c, Bool NewState)
{
	if (NewState)
	{
			NVIC_EnableIRQ(I2C_IRQn);
	}
	else
	{
			NVIC_DisableIRQ(I2C_IRQn);
	}
    return;
}


/*********************************************************************//**
 * @brief 		General Master Interrupt handler for I2C peripheral
 * @param[in]	i2c	I2C peripheral selected, should be I2C0, I2C1 or I2C2
 * @return 		None
 **********************************************************************/
void I2C_MasterHandler (LPC_I2C_TypeDef  *i2c)
{

	uint8_t returnCode;
	I2C_M_SETUP_Type *txrx_setup;

	txrx_setup = (I2C_M_SETUP_Type *) i2cdat.txrx_setup;

